data/SOAP/req12.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <ns3:echoDecimal xmlns:ns3="http://soapinterop.org/">
   <inputDecimal xsi:type="xsd:decimal">3.14159</inputDecimal>
  </ns3:echoDecimal>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
