data/SOAP/req13.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <ns3:echoBoolean xmlns:ns3="http://soapinterop.org/">
   <inputBoolean xsi:type="xsd:boolean">true</inputBoolean>
  </ns3:echoBoolean>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
