data/SOAP/req11.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <ns3:echoDate xmlns:ns3="http://soapinterop.org/">
   <inputDate xsi:type="xsd:dateTime">2001-10-05T22:07:02.837Z</inputDate>
  </ns3:echoDate>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
